
//  Логика работы функций парсеров пока непонятна



window.parse_bin = function(bin_value){
    // На вход подается строка. Проверить, что состоит только из 0 и 1
    // Проверить, что длинна ровно 52
    
    return
}


window.parse_decimal = function(bin_value){
    // На вход подается строка. Проверить, что состоит только из 0..9 и . (опционально)

    return
}



window.parse_hex = function(bin_value){
    // На вход подается строка. Проверить, что состоит только из 0..f
    // Проверить, что длинна ровно 8 

    return
}